<template>
  <div class="level-1">
    <div class="container">
      <ul class="interview">
        <li class="interview__item" v-for="(item, index) in questions" :key="index">
          <div class="interview__question">
            <p class="interview__question-text"
               v-for="(item, index) in item.question.text"
               :key="index"
            >{{ item }}</p>
        <ul class="interview__question-list" v-if="item.question.list">
          <li class="interview__question-item"
              v-for="(item, index) in item.question.list"
              :key="index"
          >{{ item }}</li>
        </ul>
          </div>
          <div class="interview__answer">
            <p class="interview__answer-text"
               v-for="(item, index) in item.answer.text"
               :key="index"
            >{{ item }}</p>
            <ul class="interview__answer-list" v-if="item.answer.links">
              <li class="interview__answer-item"
                  v-for="(item, index) in item.answer.links"
                  :key="index">
                <a :href="item.link"
                   class="interview__link"
                   target="_blank"
                >{{item.text}}</a>
                - {{ item.desc }}</li>
            </ul>
          </div>
        </li>

      </ul>
    </div>
  </div>
</template>

<script>


export default {
  name: 'Level-1',
  components: {
  },
  data() {
    return {
      questions: [
        {
          question: {
            text: ['Расскажите, чем, на ваш взгляд, отличается хорошая верстка от плохой с точки зрения'],
            list: ['пользователя;', 'менеджера проекта;', 'дизайнера;', 'верстальщика;', 'клиентского программиста;', 'серверного программиста.']
          },
          answer: {
            text: ['С точки зрения пользователя хорошая верстка должна приятно выглядеть, быстро работать, быть интуитивно понятной и доступной.', 'С точки зрения менеджера проекта хорошая верстка должна надежно работать и легко масштабироваться.', 'С точки зрения дизайнера хорошая верстка должна соответствовать макету и отражать замысел дизайнера.', 'С точки зрения верстальщика хорошая верстка должна быть понятной и удобной для поддержки (комментарии в нужных местах, использование методологии).', 'С точки зрения клиентского программиста верстка должна обладать понятной и лаконичной структурой, легко делиться на блоки для шаблонизации, иметь понятно именованные сущности, проходить тест на переполнение, должны быть сверстаны все состояния интерактивных элементов.', 'С точки зрения серверного программиста верстка должна обладать понятной и лаконичной структурой, легко делиться на блоки для шаблонизации, иметь понятно именованные сущности, проходить тест на переполнение, иметь минимум запросов к серверу (спрайты, стили и скрипты собраны и минифицированы).']
          },
        },
        {
          question: {
            text: ['Опишите основные особенности верстки крупных многостраничных сайтов дизайн которых может меняться в процессе реализации и поддержки.', 'Расскажите о своем опыте верстки подобных сайтов: какие методологии, инструменты и технологии вы применяли на практике.']
          },
          answer: {
            text: ['На мой взгляд при верстке крупных многостраничных сайтов необходимо придерживаться единого стиля написания кода во всем проекте, применять компонентный подход, использовать переменные и шаблонизацию для быстрого изменения при необходимости. Библиотека компонентов так же облегчит разработку.']
          },
        },
        {
          question: {
            text: ['Опишите основные особенности верстки сайтов, которые должны одинаково хорошо отображаться как на любом современном компьютере, так и на смартфонах и планшетах под управлением iOS и Android. Расскажите о своем опыте верстки подобных сайтов: какие инструменты и технологии вы применяли, как проверяли результат на различных устройствах, какие именно устройства требовалось поддерживать.']
          },
          answer: {
            text: ['При кроссбраузерной верстке сайтов слдеует учитывать в первую очередь: поддержку браузером свойств, встроенные стили браузера, вендорные префиксы. Для проверки поддержки свойств браузером я пользуюсь сервисом caniuse.com. Вендорные префиксы ставятся на уровне сборки при помощи плагина autoprefixer. Встроенные стили я нормализую с помощью normalize.css.  Для хорошего отображения на всех устройствах обычно использую медиа-запросы и такие технологии как flexbox и grid layout. Для тестирования пользуюсь средствами разработчика, доступными устройствами и сервисом BrowsersStack.']
          },
        },
        {
          question: {
            text: ['Расскажите, какие инструменты помогают вам экономить время в процессе написания, проверки и отладки кода.']
          },
          answer: {
            text: ['Написание: emmet, gulp, миксины, шаблонизатор(pug).', 'Проверка и отладка: линтеры, инструменты разработчика.']
          },
        },
        {
          question: {
            text: ['Вам нужно понять, почему страница отображается некорректно в Safari на iOS и в IE на Windows. Код писали не вы, доступа к исходникам у вас нет. Ваши действия? Сталкивались ли вы с подобными проблемами на практике?']
          },
          answer: {
            text: ['Любой верстальщик регулярно сталкивается с подобным. В первую очередь я воспользуюсь инструментами разработчика, попробую локализовать проблему и выяснить что работает не так, посмотрю на вендорные префиксы, погуглю, спрошу совета.']
          },
        },
        {
          question: {
            text: ['Дизайнер отдал вам макет, в котором не показано, как должны выглядеть интерактивные элементы при наведении мыши. Ваши действия?']
          },
          answer: {
            text: ['Попробую спросить у дизайнера, если такой возможности нет - реализую на свое усмотрение.']
          },
        },
        {
          question: {
            text: ['Какие ресурсы вы используете для развития в профессиональной сфере? Приведите несколько конкретных примеров (сайты, блоги и так далее).', 'Какое направление развития вам более близко: JS-программирование, HTML/CSSверстка или и то, и другое?', 'Какие ещё области знаний, кроме тех, что непосредственно относятся к работе, вам интересны?']
          },
          answer: {
            text: ['Подкаст и соцсети "Веб стандарты", Хабр, Medium, подписан на лидеров мнений в Twitter.', 'Оба направления интересны.', 'На уровне обывателя интересуюсь психофизиологией, очень помогает с мотивацией и самоорганизацией.']
          },
        },
        {
          question: {
            text: ['Расскажите нам о себе и предоставьте несколько ссылок на последние работы, выполненные вами.']
          },
          answer: {
            text: ['Я люблю: понимать что делаю и знать как это работает, концентрироваться на одной задаче, завершать работу в срок, музыку, бегать.', 'Я не люблю: опаздывать, торопиться или когда торопят, многозадачность, кабачки.'],
            links: [
              {
                link: 'https://yadi.sk/d/AvvF-3II-Ejhlw?w=1',
                text: 'Верстка интернет-магазина',
                desc: 'Кроссбраузерная, адаптивная, валидная верстка, Gulp, SCSS'
              },
              {
                link: 'https://yadi.sk/d/xFI1WOQKgQ20Ew?w=1',
                text: 'Верстка CRM',
                desc: 'Кроссбраузерная, адаптивная, валидная верстка, Gulp, SCSS'
              },
              {
                link: 'https://yadi.sk/d/DQOKSRiiaiwl9Q?w=1',
                text: 'Лэндинг',
                desc: 'Кроссбраузерная, адаптивная, валидная верстка, анимации, Gulp, SCSS, JS(JQuery)'
              },
              {
                link: 'https://liga-a.ru/case-homeless.html',
                text: 'Ночлежка',
                desc: 'адаптивная, кроссбраузерная, валидная верстка, ретинизация, SVG, Gulp, SCSS, JS(JQuery)'
              },
            ]
          },
        },
      ],
    }
  }
}
</script>

<style lang="scss">
@import "../styles/variables.scss";

.level-1 {
  padding: 80px 0 30px;

  & .container {
    padding: 10px;
  }
}

.interview {
  list-style: none;
  margin: 0;
  padding: 0;
}

.interview__item {
  padding: 10px 10px 10px 30px;
  border-radius: 10px;
  border: 4px solid $blue;
  margin-bottom: 10px;

  @media (min-width: 768px) {
    padding: 20px 20px 20px 50px;
  }
}

.interview__question {
  position: relative;
  border-bottom: 1px solid $blue;
  padding-bottom: 10px;

  &::before {
    position: absolute;
    content: "Q";
    left: -22px;
    top: -4px;
    font-size: 22px;
    color: $red;

    @media (min-width: 768px) {
      font-size: 30px;
      left: -35px;
      top: -7px;
    }
  }
}

.interview__question-list,
.interview__answer-list{
  margin-bottom: 10px;

  &:last-child {
    margin: 0;
  }
}

.interview__question-text,
.interview__answer-text{
  margin: 0 0 10px 0;

  &:last-child {
    margin: 0;
  }
}

.interview__answer {
  position: relative;
  padding-top: 10px;

  @media (min-width: 768px) {
    padding-top: 20px;
  }

  &::before {
    position: absolute;
    content: "A";
    left: -22px;
    top: 6px;
    font-size: 22px;
    color: $red;

    @media (min-width: 768px) {
      font-size: 30px;
      left: -35px;
      top: 13px;
    }
  }
}

.interview__link:hover {
  text-decoration: underline;
}

</style>
